<a href="https://colab.research.google.com/github/PUNNA-THARUN/Edyoda_Assignments/blob/main/pandas_assig.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import pandas as pd
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
df = pd.read_csv(url, sep = "|")
# User ID is taken as Index
df = df.set_index("user_id")
print("Entries: \n", '-'*45, sep='')
df.head()

Entries:
---------------------------------------------

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [21]:
# To see the first 10 entries
print("First 10 Entries \n", '-'*45, sep='')
df.head(10)

First 10 Entries
---------------------------------------------

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [22]:
# To see the last 10 entries
print("Last 10 Entries \n", '-'*45, sep='')
df.tail(10)

Last 10 Entries
---------------------------------------------

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [34]:
print("Number of Observations\n", '-'*25, sep='')
df.shape[0]

Number of Observations
-------------------------

943

In [35]:
print("Number of Columns\n", '-'*25, sep='')
df.shape[1]

Number of Columns
-------------------------

4

In [40]:
print("Index's\n", '-'*70, sep='')
df.columns

Index's
----------------------------------------------------------------------

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [42]:
print("Row index's\n", '-'*70, sep='')
df.index

Row index's
----------------------------------------------------------------------

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [72]:
print("DataFrame Info\n", '-'*70, sep='')
df.info()

DataFrame Info
----------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [51]:
print("Occupation column\n", '-'*50, sep='')
df["occupation"]

Occupation column
--------------------------------------------------

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [66]:
print("Different Types of Occupations\n", '-'*30, sep='')
df["occupation"].nunique()

Different Types of Occupations
------------------------------

21

In [70]:
print("Most frequent occupation\n", '-'*30, sep='')
df["occupation"].value_counts().idxmax()

Most frequent occupation
------------------------------

'student'

In [71]:
print("Data type of each column\n", '-'*70, sep='')
df.info()

Data type of each column
----------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [94]:
print("Summarizing only the occupation column\n", '-'*50, sep='')
df["occupation"].value_counts()

Summarizing only the occupation column
--------------------------------------------------

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [79]:
print("Describe all the columns\n", '-'*70, sep='')
df.describe

Describe all the columns
----------------------------------------------------------------------

<bound method NDFrame.describe of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

In [99]:
print("Mean age of users\n", '-'*20, sep='')
df.age.mean()

Mean age of users
--------------------

34.05196182396607

In [106]:
print("Age with least occurrence\n", '-'*25, sep='')
df["age"].min()

Age with least occurrence
-------------------------

7